{
  "slug": "apartment-renovation-maclaey-street-elizabeth-bay",
  "title": "Maclaey Street, Elizabeth Bay",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-maclaey-street-elizabeth-bay/Rectangle%20177%20(12).png",
  "content": "The client came to Inhaus Living with a clear vision: to refresh their classic Elizabeth Bay apartment while preserving its original charm. They wanted to create a bright, modern space that felt stylish yet personal, with a clean and calming aesthetic. The goal was to improve the apartment’s functionality without losing its unique character, resulting in a home that’s both practical and easy to enjoy every day.\n\nInhaus Living looked at the whole space and made smart design choices to keep it stylish but also practical, focusing on making the apartment feel brighter, more open, and easier to live in.\n\nOpen-Plan Layout: We took out some walls that weren’t holding anything up to open up the kitchen, living, and dining areas. This made the space feel bigger and flow better. It also let more natural light in, so the whole home feels brighter and more open.\n\nStreamlined Kitchen Design: Custom minimalist cabinetry was designed to reduce visual clutter, while integrated high-end appliances provided a seamless look and boosted functionality. Sleek stone benchtops and subtle textures were added to bring a sense of understated luxury to the space.\n\nContemporary Bathroom Retreat: The bathroom was designed with a spa-inspired feel, featuring clean lines and modern fittings for a relaxing, contemporary look. A freestanding bathtub serves as a sculptural focal point while elegant matte black tapware and fixtures provide a striking contrast against the soft, neutral palette.\n\nThe completed apartment brings the clients vision to life while staying true to Inhaus Living’s design approach – smart, stylish, and effortlessly functional.\n\nMake an enquiry today with Inhaus Living.\n\nHomes | Apartments | Kitchens | Bathrooms | Flooring | Construction\n\nShop 10/2A Todman Ave,\nKensington NSW 2033,\nAustralia\n\nThis website is proudly powered by the passionate team at ALEPH IT.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}