{
  "slug": "apartment-renovation-bellevue-road-bellevue-hill",
  "title": "Bellevue Road, Bellevue Hill",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/apartment-renovation-bellevue-road-bellevue-hill/Rectangle%20177%20(11).png",
  "content": "The homeowner approached Inhaus Living with a clear vision: to breathe new life into their aging apartment and transform it into a modern, elegant, and practical home that embraced open plan living.\n\nThe key goals were to maximise light, create visual flow between spaces, and incorporate timeless finishes that would feel fresh for years to come.\n\nThey also wanted to create a calm, modern space that felt open, inviting, and a little bit fancy.\n\nStreamlined Kitchen Design: We designed a white, handle-less kitchen to enhance the apartment’s sleek aesthetic. The addition of a contrasting grey island with a rebated waterfall end created visual interest and added depth.\n\nTimber Flooring Installation: Rich, natural timber floors were installed throughout the apartment, bringing warmth and texture to the space.\n\nOpen Plan Living: By removing unnecessary dividing walls, we created a spacious, open layout that seamlessly connects the kitchen, dining, and living areas. This change not only improved natural light flow but also made the home feel significantly larger.\n\nSleek, Spa-Inspired Bathroom: The bathroom was rethought to create a sense of modern, minimalist elegance. A two toned freestanding bathtub acts as the focal centrepiece, complemented by the stone textured tiled feature wall and brushed metal fixtures.\n\nThe completed apartment in Bellevue Hill is now a serene, light filled home with a calm yet sophisticated feel.\n\nEvery room flows effortlessly into the next, with layered textures, neutral tones, and custom details throughout.\n\nMake an enquiry today with Inhaus Living.\n\nHomes | Apartments | Kitchens | Bathrooms | Flooring | Construction\n\nShop 10/2A Todman Ave,\nKensington NSW 2033,\nAustralia\n\nThis website is proudly powered by the passionate team at ALEPH IT.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}