{
  "slug": "bathroom-renovation-woodward-st-coogee",
  "title": "Woodward St Coogee",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/07.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-renovation-woodward-st-coogee/Intersect%20(1).png",
  "content": "The client’s vision was to transform a tired bathroom into a modern, functional sanctuary that embraced a sense of relaxed, coastal luxury.\n\nThe goal was to honour the home’s beachside location while introducing clean lines, sophisticated textures, and practical design features to suit everyday living.\n\nInhaus Living brought the client’s vision to life with a reimagined layout and a blend of modern features and classic styles, creating two timeless, functional bathrooms with a fresh, beach-inspired feel.\n\nFreestanding Matte Black Bath: Acting as a statement piece, the bath introduces a dramatic contrast and a sculptural focal point to the room.\n\nMarble-Look Porcelain Tiles: Used across the floor, niches and feature wall to reflect natural light and offer a clean, fresh foundation with subtle movement and texture.\n\nMatte Black Fixtures: Including tapware and shower fittings, these add striking contrast and a sleek, modern edge to the space.\n\nBold Blue Tiled Feature Wall: In the smaller separate bathroom, a striking feature wall was introduced to create a unique wow factor, offering a fresh contrast in style to the other space.\n\nThe finished bathrooms are a mix of coastal style and modern design.\n\nWith black and white touches, lots of texture, and an open, breezy layout, the space feels stylish but still relaxed. The bathrooms look great and work well, creating a calm and comfy spot for our clients to enjoy.\n\nMake an enquiry today with Inhaus Living.\n\nHomes | Apartments | Kitchens | Bathrooms | Flooring | Construction\n\nShop 10/2A Todman Ave,\nKensington NSW 2033,\nAustralia\n\nThis website is proudly powered by the passionate team at ALEPH IT.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}