{
  "slug": "bathroom-and-kitchen-renovation-sagars-road-dural",
  "title": "Sagars Road, Dural",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-sagars-road-dural/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-sagars-road-dural/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-sagars-road-dural/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-sagars-road-dural/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-sagars-road-dural/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-sagars-road-dural/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-sagars-road-dural/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-sagars-road-dural/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-sagars-road-dural/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-sagars-road-dural/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-sagars-road-dural/Intersect%20(3).png",
  "content": "When Inhaus Living took on the renovation of the Sagars Road home in Dural, the goal was simple: make it look great and easy to live in. They wanted the space to feel warm, welcoming, and not go out of style. The owners were after a comfy home that looked good every day without needing much maintenance.\n\nTo bring the clients vision to life, Inhaus Living focused on keeping things simple, using plenty of natural light, and choosing materials carefully. They stuck to soft, neutral colours to keep the home feeling calm and comfortable.\n\nSpacious Kitchen: The kitchen was designed to feel bright and open, featuring white cabinetry for a fresh, timeless look and warm timber floors to add depth and character. Soft pendant lighting above the island provides a gentle glow, enhancing the cosy and inviting atmosphere.\n\nModern Bathroom: The bathroom was designed as a calm, serene retreat, with a sleek freestanding bathtub serving as a stunning focal point and the perfect place to unwind. A double vanity adds everyday convenience, while large windows flood the space with natural light, creating a fresh, open, and inviting atmosphere.\n\nSoft, Neutral Palette: Soft, neutral colours were used throughout the home to create a warm, calm, and inviting atmosphere. The simple, timeless palette not only enhances the sense of comfort but also allows for easy updates to the style over time.\n\nEvery detail, like the materials, lighting, and layout was chosen to feel warm, simple and timeless.\n\nThe result is a fresh, low-maintenance home the owners can enjoy for years, proving that good design can be beautiful and functional.\n\nMake an enquiry today with Inhaus Living.\n\nHomes | Apartments | Kitchens | Bathrooms | Flooring | Construction\n\nShop 10/2A Todman Ave,\nKensington NSW 2033,\nAustralia\n\nThis website is proudly powered by the passionate team at ALEPH IT.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}