{
  "slug": "bathroom-and-kitchen-renovation-rosehill-street-redfern",
  "title": "Rosehill St, Redfern",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/bathroom-and-kitchen-renovation-rosehill-street-redfern/Intersect%20(2).png",
  "content": "The client wanted a modern and practical home that looked stylish but was also budget-friendly. The aim was to design an apartment that felt fresh, up to date, and built with smart choices that would last for years.\n\nInhaus Living designed a practical yet stylish space with clean lines, quality finishes, and cost-efficient choices, ensuring lasting beauty and everyday liveability.\n\nModern Kitchen\nThe kitchen was designed with a streamlined layout to maximise flow and workspace efficiency, making it highly functional for everyday use. Crisp white cabinetry was chosen to brighten the space and create an open, airy feel, while sleek black fixtures add a striking modern contrast. Integrated appliances complete the look, keeping surfaces clear and maintaining a clean, uncluttered look.\n\nMinimalist Bathroom\nThis bathroom pairs a serene neutral palette with sleek black tapware for a timeless, calming retreat. A glass shower enclosure invites natural light, while a striking feature wall adds character and depth. Clean lines and subtle details create a minimalist design that’s both sophisticated and easy to maintain.\n\nMaterial Choices\nThroughout the renovation, durable and cost-effective materials were selected to deliver both quality and value. These finishes not only provide long-lasting performance but are also low maintenance, ensuring the home remains practical, stylish, and easy to care for over time.\n\nThe result is a modern, stylish apartment that’s both good-looking and practical. The design flows smoothly from the kitchen to the bathroom, giving the whole place a united feel. For this first-time owner, it’s not just beautiful, built to last, making it a smart and stylish choice.\n\nMake an enquiry today with Inhaus Living.\n\nHomes | Apartments | Kitchens | Bathrooms | Flooring | Construction\n\nShop 10/2A Todman Ave,\nKensington NSW 2033,\nAustralia\n\nThis website is proudly powered by the passionate team at ALEPH IT.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}