{
  "slug": "brompton-road-kensington",
  "title": "Brompton Road, Kensington",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/brompton-road-kensington/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/brompton-road-kensington/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/brompton-road-kensington/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/brompton-road-kensington/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/brompton-road-kensington/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/brompton-road-kensington/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/brompton-road-kensington/07.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/brompton-road-kensington/Rectangle%20177%20(4).png",
  "content": "The client came to Inhaus Living with a clear vision: to turn their Kensington home into a refined sanctuary that blends modern comfort with timeless charm. They wanted a high-end interior that feels warm and welcoming, with every room flowing naturally into the next, yet still holding its own distinct character.\n\nInhaus Living created a timeless, cohesive interior with warm neutrals, textured finishes, timber-look joinery, brushed nickel tapware, and Calacatta Plato stone, tied together with slim shaker cabinetry and updated lighting for both style and function.\n\nSophisticated Bathrooms Design\nThe bathrooms were thoughtfully designed by the team to evoke a sense of serene, hotel-style luxury. Feature marble-look tiles add a touch of drama while maintaining a refined elegance, complemented by brushed nickel tapware and sleek frameless glass for a clean, modern aesthetic. Practical elements such as smart storage solutions and stone splashbacks were integrated seamlessly, ensuring the space is as functional as it is beautiful.\n\nModern Kitchen\nThe centre of the home is a standout two-tone kitchen that mixes style with everyday use. Dark timber cabinets on top contrast nicely with the white cupboards below, creating a balanced and welcoming look. The Calacatta Plato stone benchtops and splashback give it a touch of marble style and long-lasting quality. Built-in appliances and mirrored bar shelves add a modern feel, while soft LED lighting makes it practical for cooking and cosy at night.\n\nModern Living Spaces\nThe entire home, including the modern living and dining spaces, was transformed through custom joinery, statement lighting, and curated furnishings, featuring soft neutral carpet for comfort, rich green and black accents for depth, and styled zones like a welcoming study nook and refined master bedroom, while the design seamlessly extended to the balcony and rooftop terrace, maintaining continuity between the indoors and outdoors.\n\nThe Kensington Project shows how good design and attention to detail can make a big difference. From custom-built storage to stylish finishes, every part of the home was chosen to match the client’s vision of luxury, warmth, and modern comfort. The result is a beautiful, timeless space designed to be enjoyed for years.\n\nMake an enquiry today with Inhaus Living.\n\nHomes | Apartments | Kitchens | Bathrooms | Flooring | Construction\n\nShop 10/2A Todman Ave,\nKensington NSW 2033,\nAustralia\n\nThis website is proudly powered by the passionate team at ALEPH IT.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}