{
  "slug": "clareville-ave-duplex-2-sandringham",
  "title": "Clareville Avenue Duplex 2 – Sandringham",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/clareville-ave-duplex-2-sandringham/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/clareville-ave-duplex-2-sandringham/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/clareville-ave-duplex-2-sandringham/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/clareville-ave-duplex-2-sandringham/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/clareville-ave-duplex-2-sandringham/05.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/clareville-ave-duplex-2-sandringham/Rectangle%20177.png",
  "content": "This duplex was designed as a modern, stylish home with a relaxed coastal feel. The goal was to create a bright, airy space that makes everyday living easy and enjoyable, with high-quality finishes and a smooth flow between indoor and outdoor areas.\n\nFor this project, Inhaus Living embraced a contemporary coastal aesthetic while ensuring comfort, flow, and refined detailing throughout every element of the home.\n\nLuxe Bathroom\nThis stunning bathroom is all about modern luxury. The black and white freestanding bath stands out against a marble-look feature wall, with a lit-up niche and chandelier adding a touch of glamour. Clean fixtures, a glowing marble-style basin, and black tiles keep the space sleek and calm. It’s a bold, beautiful design that ties together perfectly.\n\nOpen-Plan Living\nThe layout was designed to make the most of space and natural light, allowing easy flow between the living, dining, and kitchen areas. Large windows and well-placed openings let sunlight in, creating a bright, warm, and open-feeling home.\n\nSleek Kitchen\nThe kitchen is both practical and stylish, connecting smoothly with the rest of the home. Marble countertops add a touch of timeless elegance.\n\nLuxurious timbered outdoor area perfect for entertaining\nThe open timber outdoor area is designed for effortless entertaining. Featuring beautiful timber flooring and a covered dining space, it’s ideal for hosting gatherings in any season. Adding a touch of luxury, the built-in jacuzzi creates the perfect spot to unwind. With its inviting layout and year-round appeal, this outdoor space is sure to become a favourite for both relaxation and socialising.\n\nThe result is a contemporary home that blends style and functionality with ease. Cean lines, refined finishes, and a cohesive use of materials give the duplex a luxurious, modern feel.\n\nMake an enquiry today with Inhaus Living.\n\nHomes | Apartments | Kitchens | Bathrooms | Flooring | Construction\n\nShop 10/2A Todman Ave,\nKensington NSW 2033,\nAustralia\n\nThis website is proudly powered by the passionate team at ALEPH IT.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}