{
  "slug": "duplex-clareville-ave-duplex-1-sandringham",
  "title": "Clareville Avenue Duplex 1 – Sandringham",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/duplex-clareville-ave-duplex-1-sandringham/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-sutherland-cr-darling-point/Rectangle%20177%20(1).png",
  "content": "In the peaceful bayside suburb of Sandringham, this duplex was designed as a modern, stylish retreat with a relaxed coastal vibe. The goal was to create a bright, airy home with smart design, quality finishes, and a smooth connection between indoor and outdoor living.\n\nTo bring this vision to life, Inhaus Living embraced a meticulously crafted design approach that seamlessly blended aesthetic elegance and functional excellence.\n\nOpen-plan Layout\nThis duplex was designed with a spacious, open-plan concept that enhances flow and allows natural light to flood the interiors. This not only maximises the sense of space but also creates an inviting atmosphere ideal for family living and entertaining.\n\nSophisticated Modern Kitchen\nThe kitchen functions as both a highly practical workspace and captivating visual centrepiece, featuring sleek two-toned cabinetry and a luxurious marble island with a rebated waterfall edge, which adds striking depth and sophistication.\n\nLuxurious Bathroom\nThis bathroom was designed as a sophisticated modern retreat, combining luxury with thoughtful functionality. A striking double shower takes centre stage, featuring a marble-look feature wall and elevated step, complemented by minimalist tapware and meticulously chosen finishes. Every detail contributes to a serene space that exudes elegance and contemporary style.\n\nThe duplex has been transformed into a modern, inviting home that’s both beautiful and functional. Stylish and practical, it perfectly complements its relaxed coastal setting.\n\nMake an enquiry today with Inhaus Living.\n\nHomes | Apartments | Kitchens | Bathrooms | Flooring | Construction\n\nShop 10/2A Todman Ave,\nKensington NSW 2033,\nAustralia\n\nThis website is proudly powered by the passionate team at ALEPH IT.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}