{
  "slug": "full-home-renovation-northcote-avenue-caringbah-south",
  "title": "Northcote Avenue, Caringbah South",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-northcote-avenue-caringbah-south/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-northcote-avenue-caringbah-south/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-northcote-avenue-caringbah-south/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-northcote-avenue-caringbah-south/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-northcote-avenue-caringbah-south/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-northcote-avenue-caringbah-south/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-northcote-avenue-caringbah-south/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-northcote-avenue-caringbah-south/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-northcote-avenue-caringbah-south/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-northcote-avenue-caringbah-south/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-northcote-avenue-caringbah-south/Rectangle%20177%20(7).png",
  "content": "Our clients approached Inhaus Living with a clear vision: to transform their home into a bright, welcoming space designed for everyday living and entertaining.\n\nThey wanted to maximise natural light, improve functionality, and create an open-plan layout that connected seamlessly to the outdoors.\n\nThe goal was a modern yet timeless home that felt both stylish and practical for family life.\n\nWe configured the floor plan to enhance spatial flow and encourage connection. We created a main living, dining, and kitchen area that opens up to a big outdoor space, with large glass doors that let in lots of natural light.\n\nSophisticated Kitchen Design: The kitchen was designed as the heart of the home, featuring sleek white cabinetry contrasted with warm timber accents. The handle-less design and integrated appliances contribute to a seamless, clutter-free look.\n\nModern Bathrooms: The bathrooms were upgraded with marble-look porcelain tiles, black penny round tiles incorporated into the niches, floating vanities, and minimalist fixtures, creating spaces that are both calming and contemporary.\n\nWarm Earthy Large Format Tiles: Wide-format earthy tiles were selected to run throughout the home, bringing warmth and visual cohesion to the entire space.\n\nThe end result is a bright, beautiful home that feels both comfortable and easy to live in.\n\nFrom the smooth flow between inside and outside to the carefully chosen finishes, everything was designed to match the client’s vision for a fresh, modern space that works for everyday life.\n\nMake an enquiry today with Inhaus Living.\n\nHomes | Apartments | Kitchens | Bathrooms | Flooring | Construction\n\nShop 10/2A Todman Ave,\nKensington NSW 2033,\nAustralia\n\nThis website is proudly powered by the passionate team at ALEPH IT.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}