{
  "slug": "full-apartment-renovation-osullivan-st-rose-bay",
  "title": "O’Sullivan St, Rose Bay",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-apartment-renovation-osullivan-st-rose-bay/Rectangle%20176%20(3).png",
  "content": "The client wanted to turn their older-style apartment into a modern, stylish space that matched their taste and love for entertaining. The aim was to design a home that looked great, worked well for hosting friends, and still felt comfortable for everyday living.\n\nInhaus Living created spaces that are both stylish and practical, using open layouts, quality finishes, and smart material choices to make the apartment functional, striking, and lasting.\n\nOpen-Plan Elegance\nThe living area features an open-plan layout designed to maximise space and flow, creating a sense of openness and ease. Herringbone timber flooring adds warmth and texture, while minimalist décor keeps the space clean, contemporary, and uncluttered.\n\nSleek Kitchen\nThe kitchen combines sleek white cabinetry with stainless steel appliances for a modern, polished look. Warm wood accents introduce character and balance, while the functional layout ensures effortless entertaining and practical everyday use.\n\nMonochrome Bathroom\nThis bathroom showcases a sleek monochrome palette, featuring black minimalist tapware and a bold black vanity with a crisp white basin. Unique black-and-white decorative tiles add character, enhancing the sense of openness while adding a touch of timeless style.\n\nWarm Illumination\nLighting was carefully designed to enhance the apartment’s ambiance and highlight key architectural features. The balanced illumination supports both functional tasks and mood setting, ensuring the apartment feels welcoming and inviting at all times.\n\nThe renovation delivered a sophisticated, light-filled apartment that seamlessly blends modern style with functional design. The cohesive material palette and attention to detail create a luxurious yet practical home, perfectly suited for entertaining guests or enjoying everyday living.\n\nMake an enquiry today with Inhaus Living.\n\nHomes | Apartments | Kitchens | Bathrooms | Flooring | Construction\n\nShop 10/2A Todman Ave,\nKensington NSW 2033,\nAustralia\n\nThis website is proudly powered by the passionate team at ALEPH IT.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}