{
  "slug": "full-home-renovation-mermaid-avenue-maroubra",
  "title": "Mermaid Avenue, Maroubra",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mermaid-avenue-maroubra/Rectangle%20176%20(1).png",
  "content": "The goal was to design a modern, highly functional home that embraced the relaxed feel of coastal living while meeting the dynamic needs of a young family. The home needed to feel open and airy, encourage connection through shared spaces, and offer practical features that support everyday life, all with a calm, beach-inspired aesthetic.\n\nTo bring this vision to life, the design team focused on simplicity, flow, and functionality, with thoughtful coastal touches throughout.\n\nOpen-Plan Living: Areas were created to maximise natural light and take full advantage of expansive ocean views. Large windows and sliding glass doors blur the line between indoor and outdoor living, encouraging a laid-back beachside lifestyle.\n\nSleek Kitchen: A sleek kitchen was designed as the heart of the home, with its crisp white cabinetry, integrated appliances, and plenty of storage to keep daily life organised and clutter-free.\n\nNeutral-Toned Bathrooms: The bathrooms were kept neutral and calming, featuring contemporary fixtures and minimalist detailing, making them feel fresh, clean, and timeless.\n\nWarm Timber Flooring: Warm timber flooring was used throughout the home to tie each space together, adding texture, warmth, and a natural element that complements the coastal palette.\n\nThe end result is a stylish and practical home that’s easy to live in. It’s bright, open, and welcoming, perfect for family life and also a great place to relax. Every part of the home was carefully planned to suit its costal location, while still giving a growing family the modern layout and comforts they need. It’s coastal living made easy- simple, smart and super comfy.\n\nMake an enquiry today with Inhaus Living.\n\nHomes | Apartments | Kitchens | Bathrooms | Flooring | Construction\n\nShop 10/2A Todman Ave,\nKensington NSW 2033,\nAustralia\n\nThis website is proudly powered by the passionate team at ALEPH IT.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}