{
  "slug": "full-home-renovation-newport-beach",
  "title": "Newport Beach",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-newport-beach/Rectangle%20177%20(3).png",
  "content": "The goal for this project was to reimagine a traditional family home and transform it into a modern, light-filled sanctuary that captures the relaxed elegance of coastal living. The client wanted a space that felt open, calm, and timeless – a true retreat from the busyness of everyday life while still maintaining a sense of warmth and livability.\n\nFor this home, Inhaus Living went with a modern coastal style, using clean lines, natural textures, and soft, neutral colours to create a relaxed and fresh feel.\n\nSleek Kitchen: The kitchen was designed as a minimalist, light-filled centrepiece. With crisp white cabinetry, integrated appliances, and handleless drawers, it offers a clean, modern aesthetic balanced with subtle textures and layered lighting for depth.\n\nNeutral-Toned Bathrooms: The bathrooms were styled with a spa-like feel in mind, neutral tones, floating vanities, and matte finishes to create a serene retreat. Fixtures were chosen for both style and durability, ensuring a luxurious yet low-maintenance space.\n\nWarm Timber Flooring: Warm timber flooring was used throughout the home to help everything feel more connected and natural. The soft, warm tones work nicely with the coastal colours and make every room flow into the next.\n\nThe result is a sophisticated, airy home that balances modern design with coastal charm. Every detail has been considered to ensure that space feels effortless yet elevated, from the material selections to the open layout. It’s a home that embodies both style and function, offering the perfect backdrop for contemporary costal living.\n\nMake an enquiry today with Inhaus Living.\n\nHomes | Apartments | Kitchens | Bathrooms | Flooring | Construction\n\nShop 10/2A Todman Ave,\nKensington NSW 2033,\nAustralia\n\nThis website is proudly powered by the passionate team at ALEPH IT.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}