{
  "slug": "full-home-renovation-mccarrs-creek-road-church-point",
  "title": "McCarrs Creek Road, Church Point",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/full-home-renovation-mccarrs-creek-road-church-point/Rectangle%20177%20(9).png",
  "content": "The homeowners of this residence approached Inhaus Living with a clear objective: To breathe new life into their traditional property by transforming it into a light-filled, contemporary sanctuary.\n\nTheir dream was to create a home that felt open, airy and effortlessly connected to the outdoors, perfect for both everyday comfort and stylish entertaining.\n\nTo make this vision a reality, the Inhaus Living team looked at the whole home and gave each room a fresh new layout to improve how it works, feels, and looks.\n\nSeamless Indoor-Outdoor Flow: We restructured the floor plan into an open-plan layout and installed expansive glass doors that open out onto a newly designed outdoor entertaining area. This design invites natural light throughout the home and fosters an easy transition between indoor living and outdoor relaxation.\n\nContemporary Kitchen: A sleek, modern kitchen was created as the heart of the home, featuring a harmonious mix of crisp white cabinetry and slight warm wood finishes. A streamlined island bench offers both functionality and a sophisticated focal point for family gatherings or casual meals.\n\nElegant Bathrooms: The bathrooms were upgraded with neutral tones, marble-look finishes, and minimalist fixtures to evoke a spa-like feel. Each bathroom was created with simplicity and luxury in mind, ensuring a timeless appeal.\n\nNatural Texture and Warmth: Timber flooring was selected for its warmth and natural aesthetic, creating a grounded, cohesive feel throughout the home.\n\nThe result is a stunning, cohesive home that beautifully blends contemporary design with inviting warmth.\n\nEvery element from the open-plan living areas to the luxurious bathrooms has been thoughtfully curated to support modern living.\n\nMake an enquiry today with Inhaus Living.\n\nHomes | Apartments | Kitchens | Bathrooms | Flooring | Construction\n\nShop 10/2A Todman Ave,\nKensington NSW 2033,\nAustralia\n\nThis website is proudly powered by the passionate team at ALEPH IT.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}