{
  "slug": "lavender-street-milsons-point",
  "title": "Lavender Street, Milsons Point",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/lavender-street-milsons-point/Rectangle%20177%20(5).png",
  "content": "The client had a clear goal; they wanted a stylish and elegant ensuite that was more than just practical. They pictured a space that felt like their own private retreat, with beautiful finishes, smart design, and a calm, luxurious vibe. It needed to show off their great taste while still being comfortable, classy, and built to last.\n\nThe design was carefully curated to balance high-end aesthetics with everyday practicality. Each element was selected to contribute to a serene, spa-like atmosphere while still making a bold statement.\n\nFreestanding Bath: A freestanding bath was chosen as the centrepiece of the space, offering a sculptural focal point and inviting relaxation. A custom bench seat in the shower added both comfort and elegance, perfect for unwinding or simply enhancing daily routines.\n\nWall Hung Vanity: With a sleek stone benchtop created a clean, floating effect, while LED-lit mirrored cabinets brought in a soft glow and added functional storage without compromising the minimalist aesthetic.\n\nFull-Height Marble Look Tiles: Marble-look tiles were used all the way from floor to ceiling, giving the space a fancy, high-end feel. The soft lines in the tiles added a bit of texture and a classic look that won’t go out of style. Covering the whole wall made the room feel bigger and more open, while also keeping everything looking neat and pulled together. Plus, underfloor heating keeps the ensuite warm and cosy all year round.\n\nThe finished ensuite is a beautiful mix of classic style and modern comfort. It includes thoughtful details that match the client’s personal taste. From the high-quality materials to the soft lighting, everything was carefully chosen to make the space feel calm, relaxing, and stylish, a perfect example of luxury done right.\n\nMake an enquiry today with Inhaus Living.\n\nHomes | Apartments | Kitchens | Bathrooms | Flooring | Construction\n\nShop 10/2A Todman Ave,\nKensington NSW 2033,\nAustralia\n\nThis website is proudly powered by the passionate team at ALEPH IT.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}