{
  "slug": "terrace-renovation-elfred-street-paddington",
  "title": "Elfred Street, Paddington",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-elfred-street-paddington/Intersect.png",
  "content": "The goal was to refresh a charming yet dated corner terrace in Paddington, transforming it into a warm, functional, and stylish home for a growing family. The vision centred on blending the home’s historic character with modern comforts, preserving its architectural soul while updating it for contemporary family living.\n\nInhaus Living approached the project with a deep respect for the terrace’s heritage, carefully preserving original details while seamlessly introducing modern elements. The design strategy was guided by a balance of timeless charm and fresh sophistication.\n\nModern Kitchen: The kitchen was transformed into a stylish centrepiece with crisp white cabinetry, playful mint green appliances, and gold fixtures, creating a bright, welcoming space for everyday living.\n\nUpdated Bathrooms: Soft neutrals, marble-look tiles, and sleek brass fittings brought calm and elegance to the bathrooms, echoing the kitchen’s palette for a seamless, refined feel.\n\nLight-Filled, Family-Centred Design: A soft, cohesive palette, open layout, and thoughtful details like the sunlit nursery and inviting courtyard, enhance natural light and flow, creating a calm and connected space for family living.\n\nThe completed apartment in Bellevue Hill is now a serene, light filled home with a calm yet sophisticated feel.\n\nThe finished home is a lovely mix of old and new, bright and welcoming, designed with family life in mind. It blends classic features with modern comforts to create a timeless and cozy space that’s perfect for the next chapter of a young family’s life.\n\nHomes | Apartments | Kitchens | Bathrooms | Flooring | Construction\n\nShop 10/2A Todman Ave,\nKensington NSW 2033,\nAustralia\n\nThis website is proudly powered by the passionate team at ALEPH IT.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}