{
  "slug": "terrace-renovation-glenmore-road-paddington",
  "title": "Glenmore Road, Paddington",
  "heroImage": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/01.webp",
  "gallery": [
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/02.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/03.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/04.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/05.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/06.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/07.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/08.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/09.webp",
    "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/10.webp"
  ],
  "listCover": "https://ik.imagekit.io/ijsd2xvnc/Inhaus/projects/terrace-renovation-glenmore-road-paddington/Rectangle%20177%20(10).png",
  "content": "The goal was to breathe new life into a traditional Paddington terrace, celebrating its classic architectural charm while adapting it for modern family living. The homeowners wanted a stylish, comfortable home that honoured the character of the original structure but offered the ease and elegance of a contemporary lifestyle.\n\nInhaus Living approached the renovation with respect for the terrace’s original features, carefully preserving its historical essence while layering in fresh, modern touches to enhance practicality, light, and overall flow.\n\nPreserving Character: Original features such as decorative cornices, ceiling roses, and traditional architraves were retained to maintain a strong sense of heritage.\n\nModern Kitchen: A sleek, functional kitchen was introduced with crisp white cabinetry, stone benchtops, and high-end appliances, creating a clean and timeless heart of the home.\n\nRefined Bathrooms: The bathrooms were reimagined with contemporary fixtures, neutral colour palettes, and subtle textures, offering spa-like calm while remaining highly functional.\n\nLight and Flow: Internal reconfiguration, including the removal of unnecessary walls and careful lighting placement, improved natural light and created a more seamless connection between living spaces.\n\nThe result is a beautifully balanced home that marries the elegance of its historic bones with the clean lines and comfort of modern design. With thoughtful spatial planning, high-quality finishes, and a restrained yet warm palette, this terrace now stands as a sophisticated urban sanctuary, ideal for modern living in the heart of Paddington.\n\nMake an enquiry today with Inhaus Living.\n\nHomes | Apartments | Kitchens | Bathrooms | Flooring | Construction\n\nShop 10/2A Todman Ave,\nKensington NSW 2033,\nAustralia\n\nThis website is proudly powered by the passionate team at ALEPH IT.\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}